package day30;

public class BaekJoon_24262 {
	public static void main(String[] args) {
		//문제번호.24262
		//알고리즘 수행횟수 출력
		
		//예제코드 분석
//		MenOfPassion(A[], n) {  	A[]배열변수와 n(직접입력한 변수)가 사용된다
//		    i = ⌊n / 2⌋;				i는 직접입력한수를 2로 나눈 값
//		    return A[i]; # 코드1		A배열의 i번째 값을 출력
//		}
		
		//빅오표기법으로 구하면된다고 한다
		//O(1) – 상수 시간 : 문제를 해결하는데 오직 한 단계만 처리함.
		//O(log n)** – 로그 시간 : 문제를 해결하는데 필요한 단계들이 연산마다 특정 요인에 의해 줄어듬.
		//O(n) – 직선적 시간 : 문제를 해결하기 위한 단계의 수와 입력값 n이 1:1 관계를 가짐.
		//O(n log n) : 문제를 해결하기 위한 단계의 수가 N*(log2N) 번만큼의 수행시간을 가진다. (선형로그형)
		//O(n^2) – 2차 시간 : 문제를 해결하기 위한 단계의 수는 입력값 n의 제곱.
		//O(C^n) – 지수 시간 : 문제를 해결하기 위한 단계의 수는 주어진 상수값 C 의 n 제곱.
		
		//위 예제코드는 무조건 한번만 실행된다
		
		System.out.println(1);
		System.out.println(0);
	}

}
